garyPenhook/PIC-Assembler/edc/PIC18F46Q71.PIC
        <edc:JoinedSFRDef edc:cname="WDTPS" edc:desc="" edc:name="WDTPS" edc:nzwidth="0x10" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x7A">
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x7A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PSCNTL" edc:desc="" edc:mask="0xff" edc:name="PSCNTL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="WDTPSCNTL" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNTL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PSCNT0" edc:desc="" edc:mask="0x1" edc:name="PSCNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT1" edc:desc="" edc:mask="0x1" edc:name="PSCNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT2" edc:desc="" edc:mask="0x1" edc:name="PSCNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT3" edc:desc="" edc:mask="0x1" edc:name="PSCNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT4" edc:desc="" edc:mask="0x1" edc:name="PSCNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT5" edc:desc="" edc:mask="0x1" edc:name="PSCNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT6" edc:desc="" edc:mask="0x1" edc:name="PSCNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT7" edc:desc="" edc:mask="0x1" edc:name="PSCNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x7B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PSCNTH" edc:desc="" edc:mask="0xff" edc:name="PSCNTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="WDTPSCNTH" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PSCNT8" edc:desc="" edc:mask="0x1" edc:name="PSCNT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT9" edc:desc="" edc:mask="0x1" edc:name="PSCNT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT10" edc:desc="" edc:mask="0x1" edc:name="PSCNT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT11" edc:desc="" edc:mask="0x1" edc:name="PSCNT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT12" edc:desc="" edc:mask="0x1" edc:name="PSCNT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT13" edc:desc="" edc:mask="0x1" edc:name="PSCNT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT14" edc:desc="" edc:mask="0x1" edc:name="PSCNT14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT15" edc:desc="" edc:mask="0x1" edc:name="PSCNT15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTTMR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTTMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x7C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT16" edc:desc="" edc:mask="0x1" edc:name="PSCNT16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT17" edc:desc="" edc:mask="0x1" edc:name="PSCNT17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STATE" edc:desc="" edc:mask="0x1" edc:name="STATE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0x1f" edc:name="TMR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WDTPSCNT16" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT17" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTSTATE" edc:desc="" edc:mask="0x1" edc:name="WDTSTATE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR0" edc:desc="" edc:mask="0x1" edc:name="WDTTMR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR1" edc:desc="" edc:mask="0x1" edc:name="WDTTMR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR2" edc:desc="" edc:mask="0x1" edc:name="WDTTMR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR3" edc:desc="" edc:mask="0x1" edc:name="WDTTMR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR4" edc:desc="" edc:mask="0x1" edc:name="WDTTMR4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="WDTTMR" edc:desc="" edc:mask="0x1f" edc:name="WDTTMR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="DAC1DAT" edc:desc="" edc:name="DAC1DAT" edc:nzwidth="0x10" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x7D">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DAC1DATL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DAC1DATL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04058_dac_nbit_ctrl_v6.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x7D">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DAC1R" edc:mask="0xff" edc:name="DAC1R" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DAC1R0" edc:mask="0x1" edc:name="DAC1R0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1R1" edc:mask="0x1" edc:name="DAC1R1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1R2" edc:mask="0x1" edc:name="DAC1R2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1R3" edc:mask="0x1" edc:name="DAC1R3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1R4" edc:mask="0x1" edc:name="DAC1R4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1R5" edc:mask="0x1" edc:name="DAC1R5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1R6" edc:mask="0x1" edc:name="DAC1R6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DAC1R7" edc:mask="0x1" edc:name="DAC1R7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="DAC1RL" edc:mask="0xff" edc:name="DAC1RL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
