garyPenhook/PIC-Assembler/edc/PIC18F46Q71.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="OPA2OFFSET" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="OPA2OFFSET" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x12D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OFFSET" edc:mask="0xff" edc:name="OFFSET" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="OFFSET0" edc:mask="0x1" edc:name="OFFSET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET1" edc:mask="0x1" edc:name="OFFSET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET2" edc:mask="0x1" edc:name="OFFSET2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET3" edc:mask="0x1" edc:name="OFFSET3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET4" edc:mask="0x1" edc:name="OFFSET4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET5" edc:mask="0x1" edc:name="OFFSET5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET6" edc:mask="0x1" edc:name="OFFSET6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OFFSET7" edc:mask="0x1" edc:name="OFFSET7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2OFFSET" edc:mask="0xff" edc:name="OPA2OFFSET" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2OFFSET0" edc:mask="0x1" edc:name="OPA2OFFSET0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2OFFSET1" edc:mask="0x1" edc:name="OPA2OFFSET1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2OFFSET2" edc:mask="0x1" edc:name="OPA2OFFSET2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2OFFSET3" edc:mask="0x1" edc:name="OPA2OFFSET3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2OFFSET4" edc:mask="0x1" edc:name="OPA2OFFSET4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2OFFSET5" edc:mask="0x1" edc:name="OPA2OFFSET5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2OFFSET6" edc:mask="0x1" edc:name="OPA2OFFSET6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2OFFSET7" edc:mask="0x1" edc:name="OPA2OFFSET7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="OPA2ORS" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="OPA2ORS" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-04198_amp_opamp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x12E">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ORS" edc:mask="0x1f" edc:name="ORS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ORS0" edc:mask="0x1" edc:name="ORS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS1" edc:mask="0x1" edc:name="ORS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS2" edc:mask="0x1" edc:name="ORS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS3" edc:mask="0x1" edc:name="ORS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORS4" edc:mask="0x1" edc:name="ORS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="OPA2ORS" edc:mask="0x1f" edc:name="OPA2ORS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="OPA2ORS0" edc:mask="0x1" edc:name="OPA2ORS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2ORS1" edc:mask="0x1" edc:name="OPA2ORS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2ORS2" edc:mask="0x1" edc:name="OPA2ORS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2ORS3" edc:mask="0x1" edc:name="OPA2ORS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OPA2ORS4" edc:mask="0x1" edc:name="OPA2ORS4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x11" edc:_addr="0x12F"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATA" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x140">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATA0" edc:desc="" edc:mask="0x1" edc:name="LATA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA1" edc:desc="" edc:mask="0x1" edc:name="LATA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA2" edc:desc="" edc:mask="0x1" edc:name="LATA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA3" edc:desc="" edc:mask="0x1" edc:name="LATA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA4" edc:desc="" edc:mask="0x1" edc:name="LATA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA5" edc:desc="" edc:mask="0x1" edc:name="LATA5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA6" edc:desc="" edc:mask="0x1" edc:name="LATA6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATA7" edc:desc="" edc:mask="0x1" edc:name="LATA7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATB" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x141">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATB0" edc:desc="" edc:mask="0x1" edc:name="LATB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB1" edc:desc="" edc:mask="0x1" edc:name="LATB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB2" edc:desc="" edc:mask="0x1" edc:name="LATB2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB3" edc:desc="" edc:mask="0x1" edc:name="LATB3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB4" edc:desc="" edc:mask="0x1" edc:name="LATB4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB5" edc:desc="" edc:mask="0x1" edc:name="LATB5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB6" edc:desc="" edc:mask="0x1" edc:name="LATB6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATB7" edc:desc="" edc:mask="0x1" edc:name="LATB7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATC" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATC" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x142">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="LATD" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="LATD" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0x143">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATD0" edc:desc="" edc:mask="0x1" edc:name="LATD0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD1" edc:desc="" edc:mask="0x1" edc:name="LATD1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD2" edc:desc="" edc:mask="0x1" edc:name="LATD2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD3" edc:desc="" edc:mask="0x1" edc:name="LATD3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD4" edc:desc="" edc:mask="0x1" edc:name="LATD4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD5" edc:desc="" edc:mask="0x1" edc:name="LATD5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD6" edc:desc="" edc:mask="0x1" edc:name="LATD6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATD7" edc:desc="" edc:mask="0x1" edc:name="LATD7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
