garyPenhook/PIC-Assembler/edc/PIC18F46Q71.PIC
        <edc:SFRDef edc:access="----rnnn" edc:cname="PORTE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="PORTE" edc:nzwidth="0x8" edc:por="----xxxx" edc:_addr="0x154">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0" edc:mask="0x1" edc:name="RE0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1" edc:mask="0x1" edc:name="RE1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2" edc:mask="0x1" edc:name="RE2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE3" edc:desc="" edc:mask="0x1" edc:name="RE3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x6B" edc:_addr="0x155"/>
        <edc:SFRDef edc:access="n-------" edc:cname="APMCON" edc:desc="" edc:impl="0x80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-------" edc:name="APMCON" edc:nzwidth="8" edc:por="0-------" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C0">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="EN" edc:mask="0x1" edc:name="EN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="APMEN" edc:mask="0x1" edc:name="APMEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="APMPRE" edc:desc="" edc:name="APMPRE" edc:nzwidth="0x10" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C1">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPREL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPREL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C1">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRE" edc:mask="0xff" edc:name="PRE" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRE0" edc:mask="0x1" edc:name="PRE0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE1" edc:mask="0x1" edc:name="PRE1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE2" edc:mask="0x1" edc:name="PRE2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE3" edc:mask="0x1" edc:name="PRE3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE4" edc:mask="0x1" edc:name="PRE4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE5" edc:mask="0x1" edc:name="PRE5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE6" edc:mask="0x1" edc:name="PRE6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE7" edc:mask="0x1" edc:name="PRE7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMPRE" edc:mask="0xff" edc:name="APMPRE" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="APMPRE0" edc:mask="0x1" edc:name="APMPRE0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE1" edc:mask="0x1" edc:name="APMPRE1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE2" edc:mask="0x1" edc:name="APMPRE2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE3" edc:mask="0x1" edc:name="APMPRE3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE4" edc:mask="0x1" edc:name="APMPRE4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE5" edc:mask="0x1" edc:name="APMPRE5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE6" edc:mask="0x1" edc:name="APMPRE6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE7" edc:mask="0x1" edc:name="APMPRE7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="APMPREH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="APMPREH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05238_tmr_apm_v1_Q71.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x1b" edc:_addr="0x1C2">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PRE" edc:mask="0xff" edc:name="PRE" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="PRE8" edc:mask="0x1" edc:name="PRE8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE9" edc:mask="0x1" edc:name="PRE9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE10" edc:mask="0x1" edc:name="PRE10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE11" edc:mask="0x1" edc:name="PRE11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE12" edc:mask="0x1" edc:name="PRE12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE13" edc:mask="0x1" edc:name="PRE13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE14" edc:mask="0x1" edc:name="PRE14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PRE15" edc:mask="0x1" edc:name="PRE15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="APMPRE" edc:mask="0xff" edc:name="APMPRE" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.2">
                <edc:SFRFieldDef edc:cname="APMPRE8" edc:mask="0x1" edc:name="APMPRE8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE9" edc:mask="0x1" edc:name="APMPRE9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE10" edc:mask="0x1" edc:name="APMPRE10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE11" edc:mask="0x1" edc:name="APMPRE11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE12" edc:mask="0x1" edc:name="APMPRE12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE13" edc:mask="0x1" edc:name="APMPRE13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE14" edc:mask="0x1" edc:name="APMPRE14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="APMPRE15" edc:mask="0x1" edc:name="APMPRE15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
