garyPenhook/PIC-Assembler/edc/PIC18F46Q71.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RD1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RD1PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD1PPS0" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS1" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS2" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS3" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS4" edc:mask="0x1" edc:name="RD1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD1PPS5" edc:mask="0x1" edc:name="RD1PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RD2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RD2PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD2PPS0" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS1" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS2" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS3" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS4" edc:mask="0x1" edc:name="RD2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD2PPS5" edc:mask="0x1" edc:name="RD2PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RD3PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RD3PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD3PPS0" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS1" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS2" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS3" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS4" edc:mask="0x1" edc:name="RD3PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD3PPS5" edc:mask="0x1" edc:name="RD3PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RD4PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RD4PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD4PPS0" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS1" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS2" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS3" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS4" edc:mask="0x1" edc:name="RD4PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD4PPS5" edc:mask="0x1" edc:name="RD4PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RD5PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RD5PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD5PPS0" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS1" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS2" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS3" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS4" edc:mask="0x1" edc:name="RD5PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD5PPS5" edc:mask="0x1" edc:name="RD5PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RD6PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RD6PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x21F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD6PPS0" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS1" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS2" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS3" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS4" edc:mask="0x1" edc:name="RD6PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD6PPS5" edc:mask="0x1" edc:name="RD6PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RD7PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RD7PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="4" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x220">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD7PPS0" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS1" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS2" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS3" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS4" edc:mask="0x1" edc:name="RD7PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RD7PPS5" edc:mask="0x1" edc:name="RD7PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RE0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RE0PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x221">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE0PPS0" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS1" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS2" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS3" edc:mask="0x1" edc:name="RE0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS4" edc:mask="0x1" edc:name="RE0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE0PPS5" edc:mask="0x1" edc:name="RE0PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RE1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RE1PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x222">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE1PPS0" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS1" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS2" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS3" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS4" edc:mask="0x1" edc:name="RE1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE1PPS5" edc:mask="0x1" edc:name="RE1PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="RE2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="RE2PPS" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-xxxxx-pps-mid-v2-output-8bit.Module" edc:_refcount="5" edc:_begin="0x0" edc:_end="0x3" edc:_addr="0x223">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RE2PPS0" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS1" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS2" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS3" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS4" edc:mask="0x1" edc:name="RE2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RE2PPS5" edc:mask="0x1" edc:name="RE2PPS5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1A" edc:_addr="0x224"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT0PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT0PPS" edc:nzwidth="8" edc:por="--001000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x23E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT0PPS0" edc:mask="0x1" edc:name="INT0PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS1" edc:mask="0x1" edc:name="INT0PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS2" edc:mask="0x1" edc:name="INT0PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS3" edc:mask="0x1" edc:name="INT0PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS4" edc:mask="0x1" edc:name="INT0PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0PPS5" edc:mask="0x1" edc:name="INT0PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT0PPS" edc:mask="0x3f" edc:name="INT0PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT1PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT1PPS" edc:nzwidth="8" edc:por="--001001" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x23F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT1PPS0" edc:mask="0x1" edc:name="INT1PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS1" edc:mask="0x1" edc:name="INT1PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS2" edc:mask="0x1" edc:name="INT1PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS3" edc:mask="0x1" edc:name="INT1PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS4" edc:mask="0x1" edc:name="INT1PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1PPS5" edc:mask="0x1" edc:name="INT1PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT1PPS" edc:mask="0x3f" edc:name="INT1PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="INT2PPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="INT2PPS" edc:nzwidth="8" edc:por="--001010" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x240">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2PPS0" edc:mask="0x1" edc:name="INT2PPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS1" edc:mask="0x1" edc:name="INT2PPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS2" edc:mask="0x1" edc:name="INT2PPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS3" edc:mask="0x1" edc:name="INT2PPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS4" edc:mask="0x1" edc:name="INT2PPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2PPS5" edc:mask="0x1" edc:name="INT2PPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="INT2PPS" edc:mask="0x3f" edc:name="INT2PPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T0CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T0CKIPPS" edc:nzwidth="8" edc:por="--000100" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x241">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T0CKIPPS" edc:mask="0x3f" edc:name="T0CKIPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T0CKIPPS0" edc:mask="0x1" edc:name="T0CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS1" edc:mask="0x1" edc:name="T0CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS2" edc:mask="0x1" edc:name="T0CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS3" edc:mask="0x1" edc:name="T0CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS4" edc:mask="0x1" edc:name="T0CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T0CKIPPS5" edc:mask="0x1" edc:name="T0CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="T1CKIPPS" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="T1CKIPPS" edc:nzwidth="8" edc:por="--010000" edc:_modsrc="DOS-xxxx_pps_mid_v3_input_Q71_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x3d" edc:_addr="0x242">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PIN" edc:mask="0x7" edc:name="PIN" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="PORT" edc:mask="0x7" edc:name="PORT" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CKIPPS0" edc:mask="0x1" edc:name="T1CKIPPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS1" edc:mask="0x1" edc:name="T1CKIPPS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS2" edc:mask="0x1" edc:name="T1CKIPPS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS3" edc:mask="0x1" edc:name="T1CKIPPS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS4" edc:mask="0x1" edc:name="T1CKIPPS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKIPPS5" edc:mask="0x1" edc:name="T1CKIPPS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1CKIPPS" edc:mask="0x3f" edc:name="T1CKIPPS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
