garyPenhook/PIC-Assembler/edc/PIC18F46Q71.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x345">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RH" edc:desc="" edc:mask="0xff" edc:name="RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP2CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x346">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2MODE" edc:desc="" edc:mask="0xf" edc:name="CCP2MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP2FMT" edc:desc="" edc:mask="0x1" edc:name="CCP2FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2OUT" edc:desc="" edc:mask="0x1" edc:name="CCP2OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP2EN" edc:desc="" edc:mask="0x1" edc:name="CCP2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CCP2CAP" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="CCP2CAP" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x347">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0xf" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS3" edc:desc="" edc:mask="0x1" edc:name="CTS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2CTS" edc:desc="" edc:mask="0xf" edc:name="CCP2CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS3" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS3" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x4" edc:_addr="0x348"/>
        <edc:SFRDef edc:access="----nnnn" edc:cname="CCPTMRS0" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0101" edc:name="CCPTMRS0" edc:nzwidth="8" edc:por="----0101" edc:_addr="0x34C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="C1TSEL" edc:mask="0x3" edc:name="C1TSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="C2TSEL" edc:mask="0x3" edc:name="C2TSEL" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="C1TSEL0" edc:mask="0x1" edc:name="C1TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C1TSEL1" edc:mask="0x1" edc:name="C1TSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL0" edc:mask="0x1" edc:name="C2TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="C2TSEL1" edc:mask="0x1" edc:name="C2TSEL1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x34D"/>
        <edc:JoinedSFRDef edc:cname="CRCDATA" edc:desc="" edc:name="CRCDATA" edc:nzwidth="0x10" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x34E">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CRCDATAL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="CRCDATAL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-04065_math_progcrc_v8.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xb" edc:_addr="0x34E">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xff" edc:name="DATA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DATA0" edc:mask="0x1" edc:name="DATA0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA1" edc:mask="0x1" edc:name="DATA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA2" edc:mask="0x1" edc:name="DATA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA3" edc:mask="0x1" edc:name="DATA3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA4" edc:mask="0x1" edc:name="DATA4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA5" edc:mask="0x1" edc:name="DATA5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA6" edc:mask="0x1" edc:name="DATA6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DATA7" edc:mask="0x1" edc:name="DATA7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
