garyPenhook/PIC-Assembler/edc/PIC18F46Q71.PIC
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADACT" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADACT" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3F9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ACT" edc:desc="" edc:mask="0x3f" edc:name="ACT" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADACT0" edc:desc="" edc:mask="0x1" edc:name="ADACT0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT1" edc:desc="" edc:mask="0x1" edc:name="ADACT1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT2" edc:desc="" edc:mask="0x1" edc:name="ADACT2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT3" edc:desc="" edc:mask="0x1" edc:name="ADACT3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT4" edc:desc="" edc:mask="0x1" edc:name="ADACT4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADACT5" edc:mask="0x1" edc:name="ADACT5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADACT" edc:mask="0x3f" edc:name="ADACT" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ACT0" edc:mask="0x1" edc:name="ACT0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT1" edc:mask="0x1" edc:name="ACT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT2" edc:mask="0x1" edc:name="ACT2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT3" edc:mask="0x1" edc:name="ACT3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT4" edc:mask="0x1" edc:name="ACT4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACT5" edc:mask="0x1" edc:name="ACT5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ADCLK" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="ADCLK" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3FA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x3f" edc:name="CS" edc:nzwidth="6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS3" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS4" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCS5" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADCS" edc:mask="0x3f" edc:name="ADCS" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS4" edc:mask="0x1" edc:name="CS4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS5" edc:mask="0x1" edc:name="CS5" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-----nn" edc:cname="ADCTX" edc:desc="" edc:impl="0x83" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-----00" edc:name="ADCTX" edc:nzwidth="8" edc:por="0-----00" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3FB">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTX" edc:mask="0x3" edc:name="CTX" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="CTXSW" edc:mask="0x1" edc:name="CTXSW" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CTX0" edc:mask="0x1" edc:name="CTX0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CTX1" edc:mask="0x1" edc:name="CTX1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="ADCTX" edc:mask="0x3" edc:name="ADCTX" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="ADCTXSW" edc:mask="0x1" edc:name="ADCTXSW" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="ADCTX0" edc:mask="0x1" edc:name="ADCTX0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCTX1" edc:mask="0x1" edc:name="ADCTX1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------" edc:cname="ADCSEL1" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u------" edc:name="ADCSEL1" edc:nzwidth="8" edc:por="0x------" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3FC">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="SSI" edc:mask="0x1" edc:name="SSI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHEN" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------" edc:cname="ADCSEL2" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u------" edc:name="ADCSEL2" edc:nzwidth="8" edc:por="0x------" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3FD">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="SSI" edc:mask="0x1" edc:name="SSI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHEN" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------" edc:cname="ADCSEL3" edc:desc="" edc:impl="0xc0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u------" edc:name="ADCSEL3" edc:nzwidth="8" edc:por="0x------" edc:_modsrc="DOS-04879_adc_sarcore_mp_ctrl_v5.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x27" edc:_addr="0x3FE">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SSI" edc:mask="0x1" edc:name="SSI" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CHEN" edc:mask="0x1" edc:name="CHEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
