garyPenhook/PIC-Assembler/edc/PIC18F46Q71.PIC
        <edc:JoinedSFRDef edc:cname="IVTBASE" edc:desc="" edc:name="IVTBASE" edc:nzwidth="0x10" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45D">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTBASEL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00001000" edc:name="IVTBASEL" edc:nzwidth="8" edc:por="00001000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45D">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BASE0" edc:mask="0x1" edc:name="BASE0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE1" edc:mask="0x1" edc:name="BASE1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE2" edc:mask="0x1" edc:name="BASE2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE3" edc:mask="0x1" edc:name="BASE3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE4" edc:mask="0x1" edc:name="BASE4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE5" edc:mask="0x1" edc:name="BASE5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE6" edc:mask="0x1" edc:name="BASE6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE7" edc:mask="0x1" edc:name="BASE7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTBASEH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IVTBASEH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45E">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BASE8" edc:mask="0x1" edc:name="BASE8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE9" edc:mask="0x1" edc:name="BASE9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE10" edc:mask="0x1" edc:name="BASE10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE11" edc:mask="0x1" edc:name="BASE11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE12" edc:mask="0x1" edc:name="BASE12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE13" edc:mask="0x1" edc:name="BASE13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE14" edc:mask="0x1" edc:name="BASE14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE15" edc:mask="0x1" edc:name="BASE15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="IVTBASEU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="IVTBASEU" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03056_int_8bit_v2_IVT_REGISTERS.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x7" edc:_addr="0x45F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BASE16" edc:mask="0x1" edc:name="BASE16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE17" edc:mask="0x1" edc:name="BASE17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE18" edc:mask="0x1" edc:name="BASE18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE19" edc:mask="0x1" edc:name="BASE19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="BASE20" edc:mask="0x1" edc:name="BASE20" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="0x4" edc:beginaddr="0x0460" edc:endaddr="0x0500" edc:regionid="accesssfr">
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM1ERS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM1ERS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x460">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERS" edc:mask="0xf" edc:name="ERS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ERS0" edc:mask="0x1" edc:name="ERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS1" edc:mask="0x1" edc:name="ERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS2" edc:mask="0x1" edc:name="ERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS3" edc:mask="0x1" edc:name="ERS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="PWM1CLK" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="PWM1CLK" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x461">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CLK" edc:mask="0x1f" edc:name="CLK" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CLK0" edc:mask="0x1" edc:name="CLK0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK1" edc:mask="0x1" edc:name="CLK1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK2" edc:mask="0x1" edc:name="CLK2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK3" edc:mask="0x1" edc:name="CLK3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLK4" edc:mask="0x1" edc:name="CLK4" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
